package com.javarush.test.level04.lesson10.task02;

import java.io.*;

/* 10 чисел наоборот
Вывести на экран числа от 10 до 1 используя цикл while.
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        int i = 11;
        while(i > 1){
            i--;
            System.out.print(i + " ");//напишите тут ваш код
        }//напишите тут ваш код

    }
}
